package com.csjbot.mobileshop.feature.story;

/**
 * @author ShenBen
 * @date 2019/1/25 16:29
 * @email 714081644@qq.com
 */
public class StoryConstants {
    public static final String[] TITLES = new String[]{"国家电网介绍", "寄给舒印彪董事长的联名感谢信",
            "林仲良：从“草根”到带电作业专家", "这位电工有特权，能在航天发射现场看直播！"};
    private static final String STORY1 = "\t\t国家电网有限公司是根据《公司法》规定设立的中央直接管理的国有独资公司，" +
            "是关系国民经济命脉和国家能源安全的特大型国有重点骨干企业。公司以投资建设运营电网为核心业务，" +
            "承担着保障安全、经济、清洁、可持续电力供应的基本使命。" +
            "\n\t\t中国电力工业具有140年的历史。新中国成立后，电力工业管理体制历经多次变化。1993年，电力工业部正式成立。" +
            "1997年，国家电力公司成立，与电力工业部实行两块牌子、一套班子运行。1998年，电力工业部政府管理职能并入国家经贸委。" +
            "2002年，国务院实施电力体制改革，决定在原国家电力公司部分企事业单位基础上组建国家电网公司。" +
            "2017年，国务院实施中央企业公司制改制工作，公司由全民所有制企业整体改制为国有独资公司，名称变更为“国家电网有限公司”。" +
            "\n\t\t公司经营区域覆盖26个省（自治区、直辖市），覆盖国土面积的88%以上，供电服务人口超过11亿人。" +
            "公司注册资本8295亿元，资产总额38088.3亿元，稳健运营在菲律宾、巴西、葡萄牙、澳大利亚、意大利、希腊、中国香港等国家和地区的资产。" +
            "公司连续13年获评中央企业业绩考核A级企业，2016～2017年蝉联《财富》世界500强第2位、中国500强企业第1位，是全球最大的公用事业企业。";
    private static final String STORY2 = "尊敬的舒印彪董事长：" +
            "\n\t\t衷心感谢国家电网公司的热心帮扶和无私奉献。用“光伏”和“电商”为我们点亮了脱贫奔小康的希望！" +
            "\n\t\t落羊河村是神农架林区最偏远的山村，上坡碰鼻梁，下坡崴脚丫。老百姓的顺口溜“落羊河村一面坡，" +
            "山羊时常掉下河，百姓致富无门路，集体经济是空壳”，就是我们家乡最真实的写照。偏远、闭塞、落后曾是我们最为刺眼的标签，" +
            "穷山恶水山疙瘩是我们戏谑而又无奈的代名词，贫穷更是我们长期挥之不去、摆脱不掉的梦魇。" +
            "\n\t\t大浪淘沙，月涌江流。感谢党和国家的好政策，让我们有幸与国家电网公司牵姻缘、结对子、增友谊、共进步。" +
            "近年来，得益于电力扶贫资金的雪中送炭，落羊河村彻底告别了“无电村”的落后历史；电商平台延伸到村组，" +
            "我们的农业特产不再是“养在深闺人未识”，而真正成为了“香饽饽”“走俏货”，跑跑猪、土蜂蜜等产品远销省内外。" +
            "贫困户致富增收门路大大拓宽；村组公路得到新修和拓展，坎坷山路变坦途。特别是2017年村级光伏电站落户我村，" +
            "年增村集体经济收入不低于15万元，收益期长达25年，将有力加快我村脱贫出列步伐，巩固村级基层政权，我们期盼已久，" +
            "由衷欣喜。在村级光伏电站建设过程中，电力工人抢晴天战雨天，长期奋斗在施工一线，真正是殚精竭虑忙规划，" +
            "肩挑背驼送设施，披星戴月赶速度，保质保量要效益，彰显出国家电网公司无私奉献的社会担当和为民务实的扶贫情怀，" +
            "我们深表敬佩，衷心感谢，永远铭记。" +
            "\n\t\t经年累月离不开您的倾情帮扶，千言万语诉不尽我们的感恩之情。在此，落羊河全村92户402人真诚邀请您常来落羊河走一走，" +
            "看一看，串串门，拉拉家常，了解落羊河的风土人情，感受落羊河的山山水水，体验落羊河人的感恩之心。" +
            "吃水不忘挖井人，我们将在国家电网公司的扶持下，进一步散发内生动力，在脱贫致富奔小康的征程上，" +
            "撸起袖子加油干，发愤图强，再接再厉，共筑我们的“中国梦”。" +
            "\n最后，恭祝您身体健康，工作顺利，阖家幸福，万事如意！";
    private static final String STORY3 = "\t\t“要做就要做好。”这是林仲良的理念。30多年扎根一线的他，" +
            "爬电杆，架线路，一路摸爬滚打，从一名普通工人成长到“草根”专家，再到国家电网公司带电作业专家。" +
            "\n\t\t林仲良的家在福州，工作地点在闽南，几个月才能回家一趟。为防止大面积停电、人身伤亡、重大设备损坏和恶性误操作等事故的发生，" +
            "林仲良每月都坚持开展安全检查活动。特别是每年迎峰度夏之时，林仲良每天奔波于各个现场，线路只要一有问题，他就会出现在现场。" +
            "\n\t\t“林师傅，卓三I路A相跳闸。”巡检工小陈向他报告。2012年7月25日，500千伏卓三I路A相发生跳闸重合闸不成功故障。" +
            "接到电话后，他立即带领带电班员工，踏着崎岖的山路，翻山越岭，沿着全线进行故障排查，直到次日晚8点半工作才结束。" +
            "\n\t\t一个电话，随即到场，是林仲良多年来养成的习惯。数不清多少个炎炎夏日，数不清多少个凄冷夜晚，他穿梭在崎岖的山岭中，" +
            "为用电安全奔波着。说起林仲良，同事们都连声称赞，“他肯吃苦，也不怕吃苦”、“重担在身，尽职尽责”……诸多的赞许，" +
            "见证了他多年来奋发拼搏的工作历程。" +
            "\n\t\t林仲良只有初中学历，但他勤奋好学，每天闲下来时翻翻书成了习惯。在工作间隙，他会跑到生技部的电脑前查资料，" +
            "和管理技术人员一起探讨解决问题的办法，使自己的业务素质得以提高。“现在，新的设备和作业方式层出不穷，固步自封，" +
            "不去学习新知识，我们很快就会落后于同行，这就要求我们要取长补短，交流经验，在学习培训方面实行‘内培训，引进来，" +
            "走出去’模式，不断加大创新力度。”林仲良说。" +
            "\n\t\t身怀绝技的林仲良还善于发挥“传、帮、带”作用，带领工作室成员学业务、强技能、提素质。" +
            "为尽快让员工掌握实操技能，林仲良把课堂搬到了作业现场，登杆、爬塔、防震锤更换，他手把手地教，一对一地练。" +
            "\n\t\t2012年，以林仲良名字命名的创新工作室成立，林仲良结合平时工作经验，研发了《QBRQ轻便式带电清扫机》、" +
            "《线路保护区内桉树速生林再生防治方法》两个创新项目，投入生产后，取得很好经济效益。";

    private static final String STORY4 = "\t\t59岁的王廷才是供电公司东风线路运维班班长。40年来，他寒暑不惧，" +
            "风雨无阻，行走在戈壁滩上为航天发射保电。这一次航天发射，王廷才因病未能参加，对于即将退休的他来说是个遗憾。" +
            "但看到一手带出的徒弟圆满完成了任务，他又为此感到骄傲。" +
            "\n\t\t回想起保电的岁月，40年的记忆历历在目……" +
            "\n\t\t40年磨破了121双绝缘鞋。背上巡视装备，王廷才在空旷的戈壁滩上每天至少要步行6公里。" +
            "每条线路他都如数家珍，哪里有异常根本逃不过他的眼睛。" +
            "\n\t\t王廷才所在的东风运维班负责14条总长480公里的110千伏线路的运检工作。这些年来，他巡线走过的路，" +
            "加起来可以绕地球两圈半，121双磨破的绝缘鞋就是最好的见证。" +
            "\n\t\t师傅，您最近心脏不好，巡线的事情就交给我吧！" +
            "\n\t\t还是走一趟放心。" +
            "\n\t\t直到现在，王廷才依然坚持着自己的工作方法：每条线路一定要亲自巡视一遍。正因为如此，他比别人更“费鞋”。";

    public static final String[] STORYS = new String[]{STORY1, STORY2, STORY3, STORY4};
}
